content/posts/emacs-efficiency.org
#+title: Emacs Efficiency
#+date: [2023-03-29]

** Discover Emacs :cheatsheet:keybindings:emacs:

This is straight away from [[https://github.com/VernonGrant/discovering-emacs][VernonGrant]] who hosts a podcast for Emacs called "[[https://www.discovering-emacs.com/][Discovering-Emacs]]".
It's a great and has very much professional vibes, the explanations are Crisp and Clear!
I suggest you to check out, he even has made [[https://www.youtube.com/@discoveringemacs][YouTube channel]] for it.

I have removed some of the common bindings from this table, I have retained some unique one's which isn't discovered generally. I guess that is why the name is made (lol)

I just wanted to have a cheatsheet for it, so I decided to leave it as a post here.

You can checkout the source here ⟾ [[https://github.com/VernonGrant/emacs-keyboard-shortcuts]]

