posts/emacs-efficiency.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-01-01 Mon 16:39 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Emacs Efficiency</title>
<meta name="generator" content="Org mode">
</head>
<body>
<div id="preamble" class="status">
<link rel="stylesheet" type="text/css" href="/stylesheet.css"/>

<p align="right">
<a class="active" href="/"></a> |
<a href="/posts/">Posts</a> |
<a href="/snippets/">Snippets</a> |
<a href="/repository.html">Repository</a> |
<a href="/about.html">About</a> |
<a href="/rss.xml"> rss </a>
</p>
</div>
<div id="content">
<header>
<h1 class="title">Emacs Efficiency</h1>
</header>
<div id="outline-container-org0b30549" class="outline-2">
<h2 id="org0b30549">Discover Emacs&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cheatsheet">cheatsheet</span>&#xa0;<span class="keybindings">keybindings</span>&#xa0;<span class="emacs">emacs</span></span></h2>
<div class="outline-text-2" id="text-org0b30549">
<p>
This is straight away from <a href="https://github.com/VernonGrant/discovering-emacs">VernonGrant</a> who hosts a podcast for Emacs called &ldquo;<a href="https://www.discovering-emacs.com/">Discovering-Emacs</a>&rdquo;.
It&rsquo;s a great and has very much professional vibes, the explanations are Crisp and Clear!
I suggest you to check out, he even has made <a href="https://www.youtube.com/@discoveringemacs">YouTube channel</a> for it.
</p>

<p>
I have removed some of the common bindings from this table, I have retained some unique one&rsquo;s which isn&rsquo;t discovered generally. I guess that is why the name is made (lol)
</p>

<p>
I just wanted to have a cheatsheet for it, so I decided to leave it as a post here.
</p>

<p>
You can checkout the source here ⟾ <a href="https://github.com/VernonGrant/emacs-keyboard-shortcuts">https://github.com/VernonGrant/emacs-keyboard-shortcuts</a>
</p>
</div>
