content/posts/emacs-efficiency.org
*** General Shortcuts

| Shortcut              | Command Invoked                  | Description                                                        |
|-----------------------+----------------------------------+--------------------------------------------------------------------|
| =C-x Esc Esc=         | =repeat-complex-command=         | Edit and re-evaluate last complex command.                         |
| =C-h f=               | =describe-function=              | Help information for a function.                                   |
| =C-h x=               | =describe-command=               | Help information for a command (a function available using =M-x=). |
| =C-h l=               | =view-lossage=                   | Show log for key presses and commands.                             |
| =M--=                 | =negative-argument=              | Prefix to perform negative meta commands.                          |
| =C--=                 | =negative-argument=              | Prefix to perform negative commands.                               |
| =M-l=                 | =downcase-word=                  | Lowercase word forward.                                            |
| =M-c=                 | =capitalize-word=                | Capitalize word forward.                                           |
| =M-u=                 | =upcase-word=                    | Uppercase word forward.                                            |
| =C-<space> C-<space>= | =set-mark-command=               | Add mark to mark ring.                                             |
| =C-u C-<space>=       | =set-mark-command=               | Jump to previous mark.                                             |
| =M-q=                 | =fill-paragraph=                 | Wrap/reformat to fill column.                                      |
| =M-^=                 | =delete-indentation=             | Join previous line.                                                |
| =M-- M-^=             | =delete-indentation=             | Join following line.                                               |
| =M-{=                 | =backward-paragraph=             | Previous paragraph.                                                |
| =M-}=                 | =forward-paragraph=              | Next paragraph.                                                    |
| =C-x C-v=             | =find-alternate-file=            | Find alternative file.                                             |
| =C-x i=               | =insert-file=                    | Insert file contents into the current file.                        |
| =C-x h=               | =mark-whole-buffer=              | Highlight entire buffer.                                           |
| =C-M-\=               | =indent-region=                  | Re-indent code region in region or from previous mark point.       |
| =C-x C-x=             | =exchange-point-and-mark=        | Put the mark where point is now, and point where the mark is now.  |
| =C-x C-j=             | =dired-jump=                     | Open Dired jump.                                                   |
| =C-x SPC=             | =rectangle-mark-mode=            | Rectangle edit mode, can use string-insert-rectangle.              |
| =C-x +=               | =balance-windows=                | Resize all splits to equal sizes.                                  |
| =C-x 5 2=             | =make-frame-command=             | Open in new frame.                                                 |
| =C-x r SPC=           | =point-to-register=              | Point-to-register.                                                 |
| =C-x r j=             | =jump-to-register=               | Jump-to-register.                                                  |
| =M-s o=               | =occur=                          | List lines using regex.                                            |
| =M-s h r=             | =highlight-regexp=               | Highlights regex expression (useful for presentations).            |
| =M-r=                 | =move-to-window-line-top-bottom= | Move cursor to top, middle and bottom.                             |
| =C-l=                 | =recenter-top-bottom=            | Move text in relation to the cursor, to top, middle and bottom.    |
| =M-!=                 | =shell-command=                  | Run a shell command.                                               |
| =M-&=                 | =async-shell-command=            | Async shell command.                                               |
| =C-u 0=               | =universal-argument=             | Infinite count prefix.                                             |
| =C-u {count}=         | =universal-argument=             | Repeat operation x amount of times.                                |
| =C-x z=               | =repeat=                         | Repeat command.                                                    |
| =C-x backspace=       | =backward-kill-sentence=         | Clear mini-buffer.                                                 |
| =M-g M-g=             | =goto-line=                      | Go to line.                                                        |
| =C-x 1=               | =delete-other-windows=           | Kill other windows.                                                |
| =M-z (char)=          | =zap-to-char=                    | Zap up to char.                                                    |
| =C-x * g=             | =calc-dispatch=                  | Eval in new buffer.                                                |
| =C-u M-x=             | =universal-argument=             | Run command with additional options.                               |

