posts/emacs-efficiency.html

<div id="outline-container-orgb1e6971" class="outline-3">
<h3 id="orgb1e6971">General Shortcuts</h3>
<div class="outline-text-3" id="text-orgb1e6971">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Shortcut</th>
<th scope="col" class="org-left">Command Invoked</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>C-x Esc Esc</code></td>
<td class="org-left"><code>repeat-complex-command</code></td>
<td class="org-left">Edit and re-evaluate last complex command.</td>
</tr>

<tr>
<td class="org-left"><code>C-h f</code></td>
<td class="org-left"><code>describe-function</code></td>
<td class="org-left">Help information for a function.</td>
</tr>

<tr>
<td class="org-left"><code>C-h x</code></td>
<td class="org-left"><code>describe-command</code></td>
<td class="org-left">Help information for a command (a function available using <code>M-x</code>).</td>
</tr>

<tr>
<td class="org-left"><code>C-h l</code></td>
<td class="org-left"><code>view-lossage</code></td>
<td class="org-left">Show log for key presses and commands.</td>
</tr>

<tr>
<td class="org-left"><code>M--</code></td>
<td class="org-left"><code>negative-argument</code></td>
<td class="org-left">Prefix to perform negative meta commands.</td>
</tr>

<tr>
<td class="org-left"><code>C--</code></td>
<td class="org-left"><code>negative-argument</code></td>
<td class="org-left">Prefix to perform negative commands.</td>
</tr>

<tr>
<td class="org-left"><code>M-l</code></td>
<td class="org-left"><code>downcase-word</code></td>
<td class="org-left">Lowercase word forward.</td>
</tr>

<tr>
<td class="org-left"><code>M-c</code></td>
<td class="org-left"><code>capitalize-word</code></td>
<td class="org-left">Capitalize word forward.</td>
</tr>

<tr>
<td class="org-left"><code>M-u</code></td>
<td class="org-left"><code>upcase-word</code></td>
<td class="org-left">Uppercase word forward.</td>
</tr>

<tr>
<td class="org-left"><code>C-&lt;space&gt; C-&lt;space&gt;</code></td>
<td class="org-left"><code>set-mark-command</code></td>
<td class="org-left">Add mark to mark ring.</td>
</tr>

<tr>
<td class="org-left"><code>C-u C-&lt;space&gt;</code></td>
<td class="org-left"><code>set-mark-command</code></td>
<td class="org-left">Jump to previous mark.</td>
</tr>

<tr>
<td class="org-left"><code>M-q</code></td>
<td class="org-left"><code>fill-paragraph</code></td>
<td class="org-left">Wrap/reformat to fill column.</td>
</tr>

<tr>
<td class="org-left"><code>M-^</code></td>
<td class="org-left"><code>delete-indentation</code></td>
<td class="org-left">Join previous line.</td>
</tr>

<tr>
<td class="org-left"><code>M-- M-^</code></td>
<td class="org-left"><code>delete-indentation</code></td>
<td class="org-left">Join following line.</td>
</tr>

<tr>
<td class="org-left"><code>M-{</code></td>
<td class="org-left"><code>backward-paragraph</code></td>
<td class="org-left">Previous paragraph.</td>
</tr>

<tr>
<td class="org-left"><code>M-}</code></td>
<td class="org-left"><code>forward-paragraph</code></td>
<td class="org-left">Next paragraph.</td>
</tr>

<tr>
<td class="org-left"><code>C-x C-v</code></td>
<td class="org-left"><code>find-alternate-file</code></td>
<td class="org-left">Find alternative file.</td>
</tr>

<tr>
<td class="org-left"><code>C-x i</code></td>
<td class="org-left"><code>insert-file</code></td>
<td class="org-left">Insert file contents into the current file.</td>
</tr>

<tr>
<td class="org-left"><code>C-x h</code></td>
<td class="org-left"><code>mark-whole-buffer</code></td>
<td class="org-left">Highlight entire buffer.</td>
</tr>

<tr>
<td class="org-left"><code>C-M-\</code></td>
<td class="org-left"><code>indent-region</code></td>
<td class="org-left">Re-indent code region in region or from previous mark point.</td>
</tr>

<tr>
<td class="org-left"><code>C-x C-x</code></td>
<td class="org-left"><code>exchange-point-and-mark</code></td>
<td class="org-left">Put the mark where point is now, and point where the mark is now.</td>
</tr>

<tr>
<td class="org-left"><code>C-x C-j</code></td>
<td class="org-left"><code>dired-jump</code></td>
<td class="org-left">Open Dired jump.</td>
</tr>

<tr>
<td class="org-left"><code>C-x SPC</code></td>
<td class="org-left"><code>rectangle-mark-mode</code></td>
<td class="org-left">Rectangle edit mode, can use string-insert-rectangle.</td>
</tr>

<tr>
<td class="org-left"><code>C-x +</code></td>
<td class="org-left"><code>balance-windows</code></td>
<td class="org-left">Resize all splits to equal sizes.</td>
</tr>

<tr>
<td class="org-left"><code>C-x 5 2</code></td>
<td class="org-left"><code>make-frame-command</code></td>
<td class="org-left">Open in new frame.</td>
</tr>

<tr>
<td class="org-left"><code>C-x r SPC</code></td>
<td class="org-left"><code>point-to-register</code></td>
<td class="org-left">Point-to-register.</td>
</tr>

<tr>
<td class="org-left"><code>C-x r j</code></td>
<td class="org-left"><code>jump-to-register</code></td>
<td class="org-left">Jump-to-register.</td>
</tr>

<tr>
<td class="org-left"><code>M-s o</code></td>
<td class="org-left"><code>occur</code></td>
<td class="org-left">List lines using regex.</td>
</tr>

<tr>
<td class="org-left"><code>M-s h r</code></td>
<td class="org-left"><code>highlight-regexp</code></td>
<td class="org-left">Highlights regex expression (useful for presentations).</td>
</tr>

<tr>
<td class="org-left"><code>M-r</code></td>
<td class="org-left"><code>move-to-window-line-top-bottom</code></td>
<td class="org-left">Move cursor to top, middle and bottom.</td>
</tr>

<tr>
<td class="org-left"><code>C-l</code></td>
<td class="org-left"><code>recenter-top-bottom</code></td>
<td class="org-left">Move text in relation to the cursor, to top, middle and bottom.</td>
</tr>

<tr>
<td class="org-left"><code>M-!</code></td>
<td class="org-left"><code>shell-command</code></td>
<td class="org-left">Run a shell command.</td>
</tr>

<tr>
<td class="org-left"><code>M-&amp;</code></td>
<td class="org-left"><code>async-shell-command</code></td>
<td class="org-left">Async shell command.</td>
</tr>

<tr>
<td class="org-left"><code>C-u 0</code></td>
<td class="org-left"><code>universal-argument</code></td>
<td class="org-left">Infinite count prefix.</td>
</tr>

<tr>
<td class="org-left"><code>C-u {count}</code></td>
<td class="org-left"><code>universal-argument</code></td>
<td class="org-left">Repeat operation x amount of times.</td>
</tr>

<tr>
<td class="org-left"><code>C-x z</code></td>
<td class="org-left"><code>repeat</code></td>
<td class="org-left">Repeat command.</td>
</tr>

<tr>
<td class="org-left"><code>C-x backspace</code></td>
<td class="org-left"><code>backward-kill-sentence</code></td>
<td class="org-left">Clear mini-buffer.</td>
</tr>

<tr>
<td class="org-left"><code>M-g M-g</code></td>
<td class="org-left"><code>goto-line</code></td>
<td class="org-left">Go to line.</td>
</tr>

<tr>
<td class="org-left"><code>C-x 1</code></td>
<td class="org-left"><code>delete-other-windows</code></td>
<td class="org-left">Kill other windows.</td>
</tr>

<tr>
<td class="org-left"><code>M-z (char)</code></td>
<td class="org-left"><code>zap-to-char</code></td>
<td class="org-left">Zap up to char.</td>
</tr>

<tr>
<td class="org-left"><code>C-x * g</code></td>
<td class="org-left"><code>calc-dispatch</code></td>
<td class="org-left">Eval in new buffer.</td>
</tr>

<tr>
<td class="org-left"><code>C-u M-x</code></td>
<td class="org-left"><code>universal-argument</code></td>
<td class="org-left">Run command with additional options.</td>
</tr>
</tbody>
</table>
</div>
</div>
