content/posts/emacs-efficiency.org
*** Macros
:PROPERTIES:
:CUSTOM_ID: macros
:END:
| Shortcut          | Command Invoked             | Description                                                            |
|-------------------+-----------------------------+------------------------------------------------------------------------|
| =C-x (=           | =kmacro-start-macro=        | Define keyboard macro.                                                 |
| =C-x )=           | =kmacro-end-macro=          | End keyboard macro definition.                                         |
| =C-x e=           | =kmacro-end-and-call-macro= | Playback keyboard macro, can just keep pressing =e= after first press. |
| =C-x C-k <space>= | =kmacro-step-edit-macro=    | Open keyboard macro debugger.                                          |
| =C-x C-k e=       | =edit-kbd-macro=            | Enter macro editor, (C-c C-c) to finish editing.                       |
| =C-x C-k n=       | =kmacro-name-last-macro=    | Save the keyboard macro for later use.                                 |
|                   | =insert-kbd-macro=          | Insert a saved macro into the file, in Emacs lisp.                     |

*** Project
:PROPERTIES:
:CUSTOM_ID: project
:END:
| Shortcut  | Command Invoked                    | Description                                                                           |
|-----------+------------------------------------+---------------------------------------------------------------------------------------|
| =C-x p != | =project-shell-command=            | Run =shell-command= in the current project's root directory.                          |
| =C-x p &= | =project-async-shell-command=      | Run =async-shell-command= in the current project's root directory.                    |
| =C-x p f= | =project-find-file=                | Visit a file (with completion) in the current project.                                |
| =C-x p F= | =project-or-external-find-file=    | Visit a file (with completion) in the current project or external roots.              |
| =C-x p b= | =project-switch-to-buffer=         | Display buffer in the selected window, for a buffer belonging to the current project. |
| =C-x p s= | =project-shell=                    | Start an inferior shell in the current project's root directory.                      |
| =C-x p d= | =project-find-dir=                 | Start Dired in a directory inside the current project.                                |
| =C-x p D= | =project-dired=                    | Start Dired in the current project's root.                                            |
| =C-x p v= | =project-vc-dir=                   | Run VC-Dir in the current project's root.                                             |
| =C-x p c= | =project-compile=                  | Run =compile= in the project root.                                                    |
| =C-x p e= | =project-eshell=                   | Start Eshell in the current project's root directory.                                 |
| =C-x p k= | =project-kill-buffers=             | Kill the buffers belonging to the current project.                                    |
| =C-x p p= | =project-switch-project=           | Switch to another project by running an Emacs command.                                |
| =C-x p g= | =project-find-regexp=              | Find all matches for REGEXP in the current project's roots.                           |
| =C-x p G= | =project-or-external-find-regexp=  | Find all matches for REGEXP in the project roots or external roots.                   |
| =C-x p r= | =project-query-replace-regexp=     | Query-replace REGEXP in all the files of the project.                                 |
| =C-x p x= | =project-execute-extended-command= | Execute an extended command in project root.                                          |

*** Balanced Expressions
:PROPERTIES:
:CUSTOM_ID: balanced-expressions
:END:
| Shortcut | Command Invoked    | Description                          |
|----------+--------------------+--------------------------------------|
| =C-M-f=    | =forward-sexp=       | Forward over an sexps.               |
| =C-M-b=    | =backward-sexp=      | Backward over a sexps.               |
| =C-M-d=    | =down-list=          | Move down into a sexps.              |
| =C-M-u=    | =backward-up-list=   | Move up out of a sexps.              |
| =C-M-n=    | =forward-list=       | Move forward to the sexps.           |
| =C-M-p=    | =backward-list=      | Move backward to the previous sexps. |
| =C-M-k=    | =kill-sexp=          | Kill down into sexps.                |
| =M-(=      | =insert-parentheses= | Wraps region in parenthesis.         |

*** Query Replace
:PROPERTIES:
:CUSTOM_ID: query-replace
:END:
| Shortcut | Command Invoked | Description                                                          |
|----------+-----------------+----------------------------------------------------------------------|
| =M-%=    | =query-replace= | Start a query replace operation.                                     |
| =!=      |                 | Replace all remaining matches in this buffer with no more questions. |
| =^=      |                 | Move point back to previous match.                                   |
| =u=      |                 | Undo previous replacement.                                           |
| =U=      |                 | undo all replacements.                                               |
| =E=      |                 | Edit the replacement string.                                         |

