posts/emacs-efficiency.html

<div id="outline-container-org82c4f28" class="outline-3">
<h3 id="macros">Macros</h3>
<div class="outline-text-3" id="text-macros">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Shortcut</th>
<th scope="col" class="org-left">Command Invoked</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>C-x (</code></td>
<td class="org-left"><code>kmacro-start-macro</code></td>
<td class="org-left">Define keyboard macro.</td>
</tr>

<tr>
<td class="org-left"><code>C-x )</code></td>
<td class="org-left"><code>kmacro-end-macro</code></td>
<td class="org-left">End keyboard macro definition.</td>
</tr>

<tr>
<td class="org-left"><code>C-x e</code></td>
<td class="org-left"><code>kmacro-end-and-call-macro</code></td>
<td class="org-left">Playback keyboard macro, can just keep pressing <code>e</code> after first press.</td>
</tr>

<tr>
<td class="org-left"><code>C-x C-k &lt;space&gt;</code></td>
<td class="org-left"><code>kmacro-step-edit-macro</code></td>
<td class="org-left">Open keyboard macro debugger.</td>
</tr>

<tr>
<td class="org-left"><code>C-x C-k e</code></td>
<td class="org-left"><code>edit-kbd-macro</code></td>
<td class="org-left">Enter macro editor, (C-c C-c) to finish editing.</td>
</tr>

<tr>
<td class="org-left"><code>C-x C-k n</code></td>
<td class="org-left"><code>kmacro-name-last-macro</code></td>
<td class="org-left">Save the keyboard macro for later use.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>insert-kbd-macro</code></td>
<td class="org-left">Insert a saved macro into the file, in Emacs lisp.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org0116e18" class="outline-3">
<h3 id="project">Project</h3>
<div class="outline-text-3" id="text-project">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Shortcut</th>
<th scope="col" class="org-left">Command Invoked</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>C-x p !</code></td>
<td class="org-left"><code>project-shell-command</code></td>
<td class="org-left">Run <code>shell-command</code> in the current project&rsquo;s root directory.</td>
</tr>

<tr>
<td class="org-left"><code>C-x p &amp;</code></td>
<td class="org-left"><code>project-async-shell-command</code></td>
<td class="org-left">Run <code>async-shell-command</code> in the current project&rsquo;s root directory.</td>
</tr>

<tr>
<td class="org-left"><code>C-x p f</code></td>
<td class="org-left"><code>project-find-file</code></td>
<td class="org-left">Visit a file (with completion) in the current project.</td>
</tr>

<tr>
<td class="org-left"><code>C-x p F</code></td>
<td class="org-left"><code>project-or-external-find-file</code></td>
<td class="org-left">Visit a file (with completion) in the current project or external roots.</td>
</tr>

<tr>
<td class="org-left"><code>C-x p b</code></td>
<td class="org-left"><code>project-switch-to-buffer</code></td>
<td class="org-left">Display buffer in the selected window, for a buffer belonging to the current project.</td>
</tr>

<tr>
<td class="org-left"><code>C-x p s</code></td>
<td class="org-left"><code>project-shell</code></td>
<td class="org-left">Start an inferior shell in the current project&rsquo;s root directory.</td>
</tr>

<tr>
<td class="org-left"><code>C-x p d</code></td>
<td class="org-left"><code>project-find-dir</code></td>
<td class="org-left">Start Dired in a directory inside the current project.</td>
</tr>

<tr>
<td class="org-left"><code>C-x p D</code></td>
<td class="org-left"><code>project-dired</code></td>
<td class="org-left">Start Dired in the current project&rsquo;s root.</td>
</tr>

<tr>
<td class="org-left"><code>C-x p v</code></td>
<td class="org-left"><code>project-vc-dir</code></td>
<td class="org-left">Run VC-Dir in the current project&rsquo;s root.</td>
</tr>

<tr>
<td class="org-left"><code>C-x p c</code></td>
<td class="org-left"><code>project-compile</code></td>
<td class="org-left">Run <code>compile</code> in the project root.</td>
</tr>

<tr>
<td class="org-left"><code>C-x p e</code></td>
<td class="org-left"><code>project-eshell</code></td>
<td class="org-left">Start Eshell in the current project&rsquo;s root directory.</td>
</tr>

<tr>
<td class="org-left"><code>C-x p k</code></td>
<td class="org-left"><code>project-kill-buffers</code></td>
<td class="org-left">Kill the buffers belonging to the current project.</td>
</tr>

<tr>
<td class="org-left"><code>C-x p p</code></td>
<td class="org-left"><code>project-switch-project</code></td>
<td class="org-left">Switch to another project by running an Emacs command.</td>
</tr>

<tr>
<td class="org-left"><code>C-x p g</code></td>
<td class="org-left"><code>project-find-regexp</code></td>
<td class="org-left">Find all matches for REGEXP in the current project&rsquo;s roots.</td>
</tr>

<tr>
<td class="org-left"><code>C-x p G</code></td>
<td class="org-left"><code>project-or-external-find-regexp</code></td>
<td class="org-left">Find all matches for REGEXP in the project roots or external roots.</td>
</tr>

<tr>
<td class="org-left"><code>C-x p r</code></td>
<td class="org-left"><code>project-query-replace-regexp</code></td>
<td class="org-left">Query-replace REGEXP in all the files of the project.</td>
</tr>

<tr>
<td class="org-left"><code>C-x p x</code></td>
<td class="org-left"><code>project-execute-extended-command</code></td>
<td class="org-left">Execute an extended command in project root.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org17dc452" class="outline-3">
<h3 id="balanced-expressions">Balanced Expressions</h3>
<div class="outline-text-3" id="text-balanced-expressions">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Shortcut</th>
<th scope="col" class="org-left">Command Invoked</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>C-M-f</code></td>
<td class="org-left"><code>forward-sexp</code></td>
<td class="org-left">Forward over an sexps.</td>
</tr>

<tr>
<td class="org-left"><code>C-M-b</code></td>
<td class="org-left"><code>backward-sexp</code></td>
<td class="org-left">Backward over a sexps.</td>
</tr>

<tr>
<td class="org-left"><code>C-M-d</code></td>
<td class="org-left"><code>down-list</code></td>
<td class="org-left">Move down into a sexps.</td>
</tr>

<tr>
<td class="org-left"><code>C-M-u</code></td>
<td class="org-left"><code>backward-up-list</code></td>
<td class="org-left">Move up out of a sexps.</td>
</tr>

<tr>
<td class="org-left"><code>C-M-n</code></td>
<td class="org-left"><code>forward-list</code></td>
<td class="org-left">Move forward to the sexps.</td>
</tr>

<tr>
<td class="org-left"><code>C-M-p</code></td>
<td class="org-left"><code>backward-list</code></td>
<td class="org-left">Move backward to the previous sexps.</td>
</tr>

<tr>
<td class="org-left"><code>C-M-k</code></td>
<td class="org-left"><code>kill-sexp</code></td>
<td class="org-left">Kill down into sexps.</td>
</tr>

<tr>
<td class="org-left"><code>M-(</code></td>
<td class="org-left"><code>insert-parentheses</code></td>
<td class="org-left">Wraps region in parenthesis.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgc65bef8" class="outline-3">
<h3 id="query-replace">Query Replace</h3>
<div class="outline-text-3" id="text-query-replace">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Shortcut</th>
<th scope="col" class="org-left">Command Invoked</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>M-%</code></td>
<td class="org-left"><code>query-replace</code></td>
<td class="org-left">Start a query replace operation.</td>
</tr>

<tr>
<td class="org-left"><code>!</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Replace all remaining matches in this buffer with no more questions.</td>
</tr>

<tr>
<td class="org-left"><code>^</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Move point back to previous match.</td>
</tr>

<tr>
<td class="org-left"><code>u</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Undo previous replacement.</td>
</tr>

<tr>
<td class="org-left"><code>U</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">undo all replacements.</td>
</tr>

<tr>
<td class="org-left"><code>E</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Edit the replacement string.</td>
</tr>
</tbody>
</table>
</div>
</div>
