content/posts/emacs-efficiency.org
*** Xref
:PROPERTIES:
:CUSTOM_ID: xref
:END:
| Shortcut | Command Invoked       | Description                         |
|----------+-----------------------+-------------------------------------|
| =M-.=      | =xref-find-definitions= | Find definitions at point.          |
| =M-,=      | =xref-go-back=          | Pop marker and return.              |
| =M-?=      | =xref-find-references=  | Find references matching a pattern. |
| =C-M-.=    | =xref-find-apropos=     | Find symbols matching a pattern.    |

*** Bookmarks
:PROPERTIES:
:CUSTOM_ID: bookmarks
:END:
| Shortcut  | Command Invoked       | Description            |
|-----------+-----------------------+------------------------|
| =C-x r m= | =bookmark-set=        | Create / set bookmark. |
| =C-x r b= | =bookmark-jump=       | Open bookmark.         |
| =C-x r l= | =bookmark-bmenu-list= | List bookmarks.        |

*** Dired Buffer
:PROPERTIES:
:CUSTOM_ID: dired-buffer
:END:
| Shortcut | Command Invoked                  | Description                                                                  |
|----------+----------------------------------+------------------------------------------------------------------------------|
| =C-o=      | =dired-display-file=               | Preview file but stay in Dired buffer.                                       |
| =C-u k=    | =dired-do-kill-lines=              | Remove section.                                                              |
| =X=        | =dired-do-shell-command=           | Execute shell command on file.                                               |
| =Q=        | =dired-do-find-regexp-and-replace= | Query replace marked files, =<space>= accept, =n= decline and =C-x s= to save all. |
| =+=        | =dired-create-directory=           | Create directory.                                                            |
| =^=        | =dired-up-directory=               | Go up one directory.                                                         |
|          | =find-name-dired=                  | Recursively find a file.                                                     |

*** Interface To Spell (Ispell) and On The Fly Spell (Flyspell)
:PROPERTIES:
:CUSTOM_ID: interface-to-spell-ispell-and-on-the-fly-spell-flyspell
:END:
| Shortcut | Command Invoked                      | Description                                                                       |
|----------+--------------------------------------+-----------------------------------------------------------------------------------|
| =M $=    | =ispell-word=                        | Check and correct spelling of the word at point.                                  |
| =C-M i=  | =completion-at-point=                | Complete the word before point based on the spelling dictionary.                  |
| =M-TAB=  | =flyspell-auto-correct-word=         | Automatically corrects the current word at point, will also cycle between option. |
| =C-c $=  | =flyspell-correct-word-before-point= | Correct word before point.                                                        |

*** Org Buffer
:PROPERTIES:
:CUSTOM_ID: org-buffer
:END:
| Shortcut      | Command Invoked            | Description                                    |
|---------------+----------------------------+------------------------------------------------|
| =S-M-RET=     | =org-insert-todo-heading=  | Insert a new TODO entry below the current one. |
| =C-c / t=     | =org-match-sparse-tree=    | View todo items in a sparse tree.              |
| =C-c C-t=     | =org-todo=                 | Toggle todo item state.                        |
| =C-c C-s=     | =org-schedule=             | Schedule todo item.                            |
| =C-c C-d=     | =org-deadline=             | Add deadline to todo item.                     |
| =C-c [=       | =org-agenda-file-to-front= | Add file to agenda.                            |
| =C-c ]=       | =org-remove-file=          | Remove file to agenda.                         |
| =C-c .=       | =org-timestamp=            | Insert current date.                           |
| =C-c C-e=     | =org-export-dispatch=      | Open exporter.                                 |
| =C-c C-e #=   | =org-export-dispatch=      | Insert template.                               |
| =C-c C-e P x= | =org-export-dispatch=      | Export specific project.                       |

*** EWW
:PROPERTIES:
:CUSTOM_ID: eww
:END:
| Shortcut | Command Invoked      | Description                          |
|----------+----------------------+--------------------------------------|
| =B=      | =eww-list-bookmarks= | Display your bookmarks.              |
| =b=      | =eww-add-bookmark=   | Add the current page as a bookmark.  |
| =l=      | =eww-back-url=       | Go to the previously displayed page. |
| =r=      | =eww-forward-url=    | Go to the next displayed page.       |
| =g=      | =eww-reload=         | Reload the current page.             |
| =G=      | =eww=                | Go to a new address.                 |
| =H=      | =eww-list-histories= | Shows a list of your histories.      |
| =TAB=    | =shr-next-link=      | Skip to the next link.               |

