posts/emacs-efficiency.html

<div id="outline-container-orgd1a4211" class="outline-3">
<h3 id="xref">Xref</h3>
<div class="outline-text-3" id="text-xref">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Shortcut</th>
<th scope="col" class="org-left">Command Invoked</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>M-.</code></td>
<td class="org-left"><code>xref-find-definitions</code></td>
<td class="org-left">Find definitions at point.</td>
</tr>

<tr>
<td class="org-left"><code>M-,</code></td>
<td class="org-left"><code>xref-go-back</code></td>
<td class="org-left">Pop marker and return.</td>
</tr>

<tr>
<td class="org-left"><code>M-?</code></td>
<td class="org-left"><code>xref-find-references</code></td>
<td class="org-left">Find references matching a pattern.</td>
</tr>

<tr>
<td class="org-left"><code>C-M-.</code></td>
<td class="org-left"><code>xref-find-apropos</code></td>
<td class="org-left">Find symbols matching a pattern.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orge143e69" class="outline-3">
<h3 id="bookmarks">Bookmarks</h3>
<div class="outline-text-3" id="text-bookmarks">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Shortcut</th>
<th scope="col" class="org-left">Command Invoked</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>C-x r m</code></td>
<td class="org-left"><code>bookmark-set</code></td>
<td class="org-left">Create / set bookmark.</td>
</tr>

<tr>
<td class="org-left"><code>C-x r b</code></td>
<td class="org-left"><code>bookmark-jump</code></td>
<td class="org-left">Open bookmark.</td>
</tr>

<tr>
<td class="org-left"><code>C-x r l</code></td>
<td class="org-left"><code>bookmark-bmenu-list</code></td>
<td class="org-left">List bookmarks.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgd66bb7b" class="outline-3">
<h3 id="dired-buffer">Dired Buffer</h3>
<div class="outline-text-3" id="text-dired-buffer">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Shortcut</th>
<th scope="col" class="org-left">Command Invoked</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>C-o</code></td>
<td class="org-left"><code>dired-display-file</code></td>
<td class="org-left">Preview file but stay in Dired buffer.</td>
</tr>

<tr>
<td class="org-left"><code>C-u k</code></td>
<td class="org-left"><code>dired-do-kill-lines</code></td>
<td class="org-left">Remove section.</td>
</tr>

<tr>
<td class="org-left"><code>X</code></td>
<td class="org-left"><code>dired-do-shell-command</code></td>
<td class="org-left">Execute shell command on file.</td>
</tr>

<tr>
<td class="org-left"><code>Q</code></td>
<td class="org-left"><code>dired-do-find-regexp-and-replace</code></td>
<td class="org-left">Query replace marked files, <code>&lt;space&gt;</code> accept, <code>n</code> decline and <code>C-x s</code> to save all.</td>
</tr>

<tr>
<td class="org-left"><code>+</code></td>
<td class="org-left"><code>dired-create-directory</code></td>
<td class="org-left">Create directory.</td>
</tr>

<tr>
<td class="org-left"><code>^</code></td>
<td class="org-left"><code>dired-up-directory</code></td>
<td class="org-left">Go up one directory.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>find-name-dired</code></td>
<td class="org-left">Recursively find a file.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org92cbc00" class="outline-3">
<h3 id="interface-to-spell-ispell-and-on-the-fly-spell-flyspell">Interface To Spell (Ispell) and On The Fly Spell (Flyspell)</h3>
<div class="outline-text-3" id="text-interface-to-spell-ispell-and-on-the-fly-spell-flyspell">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Shortcut</th>
<th scope="col" class="org-left">Command Invoked</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>M $</code></td>
<td class="org-left"><code>ispell-word</code></td>
<td class="org-left">Check and correct spelling of the word at point.</td>
</tr>

<tr>
<td class="org-left"><code>C-M i</code></td>
<td class="org-left"><code>completion-at-point</code></td>
<td class="org-left">Complete the word before point based on the spelling dictionary.</td>
</tr>

<tr>
<td class="org-left"><code>M-TAB</code></td>
<td class="org-left"><code>flyspell-auto-correct-word</code></td>
<td class="org-left">Automatically corrects the current word at point, will also cycle between option.</td>
</tr>

<tr>
<td class="org-left"><code>C-c $</code></td>
<td class="org-left"><code>flyspell-correct-word-before-point</code></td>
<td class="org-left">Correct word before point.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org2699a83" class="outline-3">
<h3 id="org-buffer">Org Buffer</h3>
<div class="outline-text-3" id="text-org-buffer">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Shortcut</th>
<th scope="col" class="org-left">Command Invoked</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>S-M-RET</code></td>
<td class="org-left"><code>org-insert-todo-heading</code></td>
<td class="org-left">Insert a new TODO entry below the current one.</td>
</tr>

<tr>
<td class="org-left"><code>C-c / t</code></td>
<td class="org-left"><code>org-match-sparse-tree</code></td>
<td class="org-left">View todo items in a sparse tree.</td>
</tr>

<tr>
<td class="org-left"><code>C-c C-t</code></td>
<td class="org-left"><code>org-todo</code></td>
<td class="org-left">Toggle todo item state.</td>
</tr>

<tr>
<td class="org-left"><code>C-c C-s</code></td>
<td class="org-left"><code>org-schedule</code></td>
<td class="org-left">Schedule todo item.</td>
</tr>

<tr>
<td class="org-left"><code>C-c C-d</code></td>
<td class="org-left"><code>org-deadline</code></td>
<td class="org-left">Add deadline to todo item.</td>
</tr>

<tr>
<td class="org-left"><code>C-c [</code></td>
<td class="org-left"><code>org-agenda-file-to-front</code></td>
<td class="org-left">Add file to agenda.</td>
</tr>

<tr>
<td class="org-left"><code>C-c ]</code></td>
<td class="org-left"><code>org-remove-file</code></td>
<td class="org-left">Remove file to agenda.</td>
</tr>

<tr>
<td class="org-left"><code>C-c .</code></td>
<td class="org-left"><code>org-timestamp</code></td>
<td class="org-left">Insert current date.</td>
</tr>

<tr>
<td class="org-left"><code>C-c C-e</code></td>
<td class="org-left"><code>org-export-dispatch</code></td>
<td class="org-left">Open exporter.</td>
</tr>

<tr>
<td class="org-left"><code>C-c C-e #</code></td>
<td class="org-left"><code>org-export-dispatch</code></td>
<td class="org-left">Insert template.</td>
</tr>

<tr>
<td class="org-left"><code>C-c C-e P x</code></td>
<td class="org-left"><code>org-export-dispatch</code></td>
<td class="org-left">Export specific project.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgbb331fb" class="outline-3">
<h3 id="eww">EWW</h3>
<div class="outline-text-3" id="text-eww">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Shortcut</th>
<th scope="col" class="org-left">Command Invoked</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>B</code></td>
<td class="org-left"><code>eww-list-bookmarks</code></td>
<td class="org-left">Display your bookmarks.</td>
</tr>

<tr>
<td class="org-left"><code>b</code></td>
<td class="org-left"><code>eww-add-bookmark</code></td>
<td class="org-left">Add the current page as a bookmark.</td>
</tr>

<tr>
<td class="org-left"><code>l</code></td>
<td class="org-left"><code>eww-back-url</code></td>
<td class="org-left">Go to the previously displayed page.</td>
</tr>

<tr>
<td class="org-left"><code>r</code></td>
<td class="org-left"><code>eww-forward-url</code></td>
<td class="org-left">Go to the next displayed page.</td>
</tr>

<tr>
<td class="org-left"><code>g</code></td>
<td class="org-left"><code>eww-reload</code></td>
<td class="org-left">Reload the current page.</td>
</tr>

<tr>
<td class="org-left"><code>G</code></td>
<td class="org-left"><code>eww</code></td>
<td class="org-left">Go to a new address.</td>
</tr>

<tr>
<td class="org-left"><code>H</code></td>
<td class="org-left"><code>eww-list-histories</code></td>
<td class="org-left">Shows a list of your histories.</td>
</tr>

<tr>
<td class="org-left"><code>TAB</code></td>
<td class="org-left"><code>shr-next-link</code></td>
<td class="org-left">Skip to the next link.</td>
</tr>
</tbody>
</table>
</div>
</div>
